# DocumentWorksharingEnabled Event

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..DocumentWorksharingEnabled Event
Application Class See Also
---
Subscribe to the DocumentWorksharingEnabled event to be notified when a document has become workshared.
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public event EventHandler<DocumentWorksharingEnabledEventArgs> DocumentWorksharingEnabled
```

Visual Basic
---
```text
Public Event DocumentWorksharingEnabled As EventHandler(Of DocumentWorksharingEnabledEventArgs)
```

Visual C++
---
```text
public:
 event EventHandler<DocumentWorksharingEnabledEventArgs^>^ DocumentWorksharingEnabled {
	void add (EventHandler<DocumentWorksharingEnabledEventArgs^>^ value);
	void remove (EventHandler<DocumentWorksharingEnabledEventArgs^>^ value);
}
```

# Remarks
This event is raised when Revit has just enabled worksharing in the document.
Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.
# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace